// Задача 1
// Ввод и вывод данных, оператор присваевания
// Найти периетр
// let a = 2
// let p = 4*a
// console.log(p)
// ===========================
// Задача 2
// Ввод и вывод данных, оператор присваевания
// let a = 8
// let s = a**2
// console.log(s)
// ===========================
// Задача 3
// Целые числа
// let l = 250
// let m = l/100
// let result = Math.trunc(m)
// ==============================
// Задача 4
// Логическое выражение
// let a = -5
// if(a > 0) 
// console.log(true)
// else
// console.log(false)
// =================================
// Задача 5
// Логические выражения
// let a = 3, b =3
// if(a>2 && b<=3) {
//     console.log(true)
// } else {
//     console.log(false)
// }
// ====================================
// Задача 6
// Условный оператор
// let a = 6, b = 7
// if (a,b> 0) {
//     a = a + 1
//     b = b + 1
//     console.log(a,b)
// } else {
// console.log(a,b)
// }
// ===========================================
// Задача 7 
// Условный оператор
// let positive = 0; negative = 0
// let a = 5, b = -6, c = -1

// if(a > 0) {
//     positive++
// } else if(a < 0) {
//     negative++
// }
// if(b > 0) {
//     positive++
// } else if(b < 0) {
//     negative++
// }
// if(c > 0) {
//     positive++
// } else if(c < 0) {
//     negative++
// }
// console.log(`Положительных: ${positive} \n Отрицательных: ${negative}`)
// ============================================================================
// Задача 8
// Оператор выбора
// let day =  1
// switch(day) {
//     case 1 :
//         alert(`Понедельник`);
//         break
//     case 2 :
//         alert(`Вторник`);
//         break
//     case 3 :
//         alert(`Среда`);
//         break
//     case 4 :
//         alert(`Четверг`);
//         break
//     case 5 :
//         alert(`Пятница`);
//         break
//     case 6 :
//         alert(`Суббота`);
//         break
//     case 7 :
//         alert(`Воскресенье`);
//         break
//         default:
//             alert(`Неизвестно`)
// }
// =============================================================
// Задача 9
// Цикл с параметром
// let k = 4, n = 8
// for(let i =0; i<n; i++) {
//     console.log(k)
// }
// ===========================================================
// Задача 10
// Цикл с условием
// let a = 11, b = 3
// let i = 0
// while(i <= a-b) {
//     i += b
// }
// console.log(`Длтна отрезка незанятой части A: ${a - i}`)
// ===============================================================
// Задача 11
// Оператор выбора
// let k = 3
// switch(k) {
//     case 1:
//         console.log("Плохо")
//         break
//     case 2:
//         console.log("Неудовлетварительно")
//         break
//     case 3:
//         console.log("Удовлетварительно")
//         break
//     case 4:
//         console.log("Хорошо")
//         break
//     case 5:
//         console.log("Отлично")
//         break
//     default:
//         console.log("Ошибка")
//         break
// }
// =================================================================
// Задача 12
// Цикл с параметром
// let a = 5, b = 12, count = 0
// for(let i=a; i<=b; i++) {
//     console.log(i)
//     count++
// }
// console.log(`Всего чисел :` + count)
// =================================================================
// Задача 13
// Условный оператор
// let positive = 0, negative = 0
// let a = 4

// if(a>=5) {
//     a = a + 1
//     positive++
// } else if(a<=5) {
//     a = a -2
//     negative++
// }
// console.log(`Положительных: ${positive} \n Отрицательны: ${negative} \n ${a}`)
// =========================================================================================
// Задача 14
// Логическое выражение
// let a = 7
// function delenie(a) {
//     if(a%2) {
//         return true
//     } else return false
// }
// console.log(delenie(a))
// ======================================================================
// Задача 15
// Целые числа
// let m = 27894
// function Mass(kg) {
//     return(Math.trunc(kg/1000))
// }
// console.log(Mass(m))
// =====================================================================
// Задача 16
// Ввод и вывод данных, оператори присвоения
// let a = 14, b = 8
// function PandS (a,b) {
//     console.log("S = " + a * b)
//     console.log("P = " + 2 * (a + b))
// }
// PandS(a,b)
// ================================================================
// Задача 17
// Целые числа
// let a = 5000
// function bait (a) {
//     console.log("Килобайты = " + a/1024)
// }
// bait(a)
// =================================================================
// Задача 18 
// Логические выражения
// let a = 24 
// function chetnoe(a) {
//     if(!(a%2)) {
//         return true
//     } else return false
// }
// console.log(chetnoe(a))
// ===================================================================
// Задача 19
// Последовательности
// let a =[11, 3, 6, 22, 54, 65, 11, 22, 12, 8]
// function arraySum(arr) {
//     let result = 0
//     for(let i=0; i<arr.length; i++) {
//         result += arr[i]
//     }
//     return result
// }
// console.log(arraySum(a))
// ====================================================================
// Задача 20
// Процедуры и функции
// let numbers = [0, 1, 2, 3, 4]
// function PowerA3(a) {
//     return a ** 3
// } 
// for(let i=0; i<numbers.length; i++) {
//     console.log(PowerA3(numbers[i]))
// }
// ===========================================================
// Задаяа 21 
// Процедуры и функции
// let radius = [3, 4, 8, 5]
// function CircleS(r) {
//     // Math.floor() = округляет в меньшую сторону
//     // Math.PI = "pi" или = 3.14
//     return Math.floor(Math.PI * r ** 2)
// }
// for(let i=0; i<radius.length; i++) {
//     console.log(`Circle №${i + 1} S= ` + CircleS(radius[i]))
// }
// ================================================================
// Задача 22 
// Ввод и вывод данных, оператор присваевания
// let d = 8
// function length (d) {
//     console.log(`Длина окружнасти = ` + Math.PI * d)
// }
// length(d)
// =================================================================
// Задача 23
// Ввод и вывод данных, оператор присваевания
let a = 7
function cube (a) {
    console.log(`V = ` + a**3)
    console.log(`S = ` + 6 * (a**2))
}
cube(a)