// функции
// alert = окно перед загрузкой
// alert("Текстовая стрка")
// ====================================
// prompt = диологовое окно с вопосом
// let age = prompt("Введите ваш возраст")
// if(age != null) {
//     alert ("Мрй возраст" + age)
// } else {
//     alert("Вы нажали отмена")
// }
// ==========================================
// if(confirm("Удалить ваш акаунт?")) {
//     alert("Удалено")
// } else {
//     alert("Отменено")
// }
// -------------------------------------------
// Тернанрый оператор
// confirm("Удалить ваш акаунт?") ? alert("Удалено") : alert("Отменено")
// ===================================
// let age = prompt("Введите ваш возраст")
// if(age < 18) {
//     alert ("Мрй возраст vtymit 18" )
// } else if(age > 18) {
//     alert("Мне больше 18")
// } else if (age == 18) {
//     alert("Мне 18 лет")
// }
// =============================================
let age = promt("Введите ваш возраст")
switch(true) {
    case age > 18:
    alert("Мне больше 18 лет")
    break;
    case age < 18 && age > 0:
    alert("Мне меньше 18 лет")
     break;
     case age == 18:
        alert("Мне 18 лет")
        break;
    default:
    alert("Не правильный возраст")
}